In [1]:
import pandas as pd
import numpy as np

In [2]:
#jan 2019 data
x=pd.read_csv(r'C:\Users\prati\Downloads\19-20\enrolled_feb05-1.csv')
y=pd.read_csv(r'C:\Users\prati\Downloads\19-20\enrolled_feb05-1.csv')
df=pd.concat([x,y])
df.head()

c:\users\prati\appdata\local\programs\python\python39\lib\site-packages\IPython\core\interactiveshell.py:3418: DtypeWarning: Columns (10) have mixed types.Specify dtype option on import or set low_memory=False.
  exec(code_obj, self.user_global_ns, self.user_ns)

,Unnamed: 0,user_id,Course_id,age_group,country,state,city,college,local_chapter,college_id,graduation year,profession,scholarship,qualification,degree,department,study_year,designation,motivation,exam_taker
0,0,User2934854,noc19-ae01,13-20,IN,Telangana,HYDERABAD,MLR INSTITUTE OF TECHNOLOGY,True,773,2022,student,False,pre_university,btech,Aeronautical Engineering,,,student_stay_updated,True
1,1,User758130,noc19-ae01,20-30,IN,Tamil_Nadu,CHENNAI,PRINCE SHRI VENKATESHWARA PADMAVATHY ENGINEER...,True,331,2018,student,False,bachelor4yr,be,Mechanical Engineering,,,student_internship_job,True
2,2,User2977501,noc19-ae01,20-30,IN,Telangana,Warangal,BALAJI INSTITUTE OF TECHNOLOGY & SCIENCE,True,1238,2021,student,False,diploma,btech,Mechanical Engineering,,,student_internship_job,True
3,3,User1293511,noc19-ae01,20-30,IN,Delhi,Delhi,,True,,2014,employed,False,pre_university,,,,,professional_stay_updated,False
4,4,User2704798,noc19-ae01,20-30,IN,Karnataka,CHICKBALLAPUR,SRI JAGADGURU CHANDRASHEKARANATHA SWAMIJI INS...,True,496,2014,faculty,False,masters,,Aeronautical Engineering,,,faculty_research,False

In [3]:
# july 19 ,jan 20 and jul 2019 data
df1=pd.read_csv(r'C:\Users\prati\Downloads\19-20\july19_full_dt.csv')
df2=pd.read_csv(r'C:\Users\prati\Downloads\19-20\jan20_full_dt.csv')
df3=pd.read_csv(r'C:\Users\prati\Downloads\19-20\july20_full_dt.csv')

c:\users\prati\appdata\local\programs\python\python39\lib\site-packages\IPython\core\interactiveshell.py:3418: DtypeWarning: Columns (10) have mixed types.Specify dtype option on import or set low_memory=False.
  exec(code_obj, self.user_global_ns, self.user_ns)
c:\users\prati\appdata\local\programs\python\python39\lib\site-packages\IPython\core\interactiveshell.py:3418: DtypeWarning: Columns (9,12,18) have mixed types.Specify dtype option on import or set low_memory=False.
  exec(code_obj, self.user_global_ns, self.user_ns)

In [47]:
df2.head()

,Unnamed: 0,Unnamed: 0.1,user_id,age_group,country,state,city,college,local_chapter,college_id,...,scholarship,qualification,degree,department,study_year,designation,motivation,exam_taker,employer_id,Course_id
0,0,0,User1668813,30-40,IN,Andhra_Pradesh,GUNTUR,VIGNAN'S FOUNDATION FOR SCIENCE TECHNOLOGY AN...,True,1366,...,False,masters,,Textile Engineering,,,,False,,noc20_te05
1,1,1,User1065388,20-30,IN,West_Bengal,BERHAMPORE,GOVT. COLLEGE OF ENGINEERING & TEXTILE TECHNO...,True,708,...,False,high_school,btech,Textile Engineering,3,,,False,,noc20_te05
2,2,2,User1274387,30-40,IN,Tamil_Nadu,Coimbatore,PSG College of Technology,True,1163,...,False,doctoral,,Textile Engineering,,,,False,,noc20_te05
3,3,3,User194714,13-20,IN,Rajasthan,JAIPUR,UNIVERSITY OF ENGINEERING AND MANAGEMENT JAIPUR,True,485,...,False,pre_university,btech,Electronics and Communication Engineering,3,,,False,,noc20_te05
4,4,4,User426027,13-20,IN,Maharashtra,PUNE,VISHWAKARMA INSTITUTE OF INFORMATION TECHNOLOGY,True,377,...,False,diploma,btech,Information Technology,3,,,False,,noc20_te05

In [48]:
# jan 2021
def MID(s, start, length):
    # example: MID("apple",2,3) returns "ppl"
    return str(s[start - 1: start - 1 + length])

import glob
#import pandas as pd

df_list = []
for file in glob.glob(r'C:\Users\prati\Downloads\2021\Jan\*.csv'):
    # Tweak this to work for your actual filepaths, if needed.
   
    t_course_id = MID(file,47,10)
    #print(course_id)
    df = (pd.read_csv(file)
            .assign(Course_id=t_course_id))
    df_list.append(df)

df4 = pd.concat(df_list)

c:\users\prati\appdata\local\programs\python\python39\lib\site-packages\IPython\core\interactiveshell.py:3418: DtypeWarning: Columns (8,11) have mixed types.Specify dtype option on import or set low_memory=False.
  exec(code_obj, self.user_global_ns, self.user_ns)

In [49]:
# jul 2021
df_list = []
for file in glob.glob(r'C:\Users\prati\Downloads\2021\July\*.csv'):
    # Tweak this to work for your actual filepaths, if needed.
   
    t_course_id = MID(file,47,10)
    #print(course_id)
    df = (pd.read_csv(file)
            .assign(Course_id=t_course_id))
    df_list.append(df)

df5 = pd.concat(df_list)

c:\users\prati\appdata\local\programs\python\python39\lib\site-packages\IPython\core\interactiveshell.py:3418: DtypeWarning: Columns (11) have mixed types.Specify dtype option on import or set low_memory=False.
  exec(code_obj, self.user_global_ns, self.user_ns)

In [50]:
# all sem data
df6=pd.concat([df,df1,df2,df3,df4,df5])
df6.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 9490195 entries, 0 to 336
Data columns (total 25 columns):
 #   Column           Dtype
---  ------           -----
 0   Unnamed: 0       int64
 1   user_id          object
 2   age_group        object
 3   country          object
 4   state            object
 5   city             object
 6   college          object
 7   local_chapter    object
 8   college_id       object
 9   graduation year  object
 10  profession       object
 11  scholarship      object
 12  qualification    object
 13  degree           object
 14  department       object
 15  study_year       object
 16  designation      object
 17  motivation       object
 18  exam_taker       object
 19  employer_id      object
 20  Course_id        object
 21  Unnamed: 0.1     float64
 22   city            object
 23   scholarship     object
 24   degree          object
dtypes: float64(1), int64(1), object(23)
memory usage: 1.8+ GB

In [53]:
df7=df6.drop(['country', 'state','city','college','local_chapter','college_id','motivation','Unnamed: 0','Unnamed: 0.1','employer_id'], axis=1)

In [54]:
df7.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 9490195 entries, 0 to 336
Data columns (total 15 columns):
 #   Column           Dtype
---  ------           -----
 0   user_id          object
 1   age_group        object
 2   graduation year  object
 3   profession       object
 4   scholarship      object
 5   qualification    object
 6   degree           object
 7   department       object
 8   study_year       object
 9   designation      object
 10  exam_taker       object
 11  Course_id        object
 12   city            object
 13   scholarship     object
 14   degree          object
dtypes: object(15)
memory usage: 1.1+ GB

!pip install openpyxl
import openpyxl
z=pd.read_excel(r'C:\Users\prati\Downloads\NPTEL_Overall_course_list.xlsx')
z.head()

z.rename(columns={'NOC Course Id':'Course_id'}, inplace=True)

z['Course_id']=z['Course_id'].str.strip()
df7['Course_id']=df7['Course_id'].str.strip()

z['Course Name'] = z['Course Name'].astype(str)
z['Semester'] = z['Semester'].astype(str)
z['SME Name'] = z['SME Name'].astype(str)
z['Institute'] = z['Institute'].astype(str)
z['Course_id'] = z['Course_id'].astype(str)

In [72]:
df7=df7.drop(['scholarship', ' scholarship'], axis=1)

In [73]:
df7=df7.drop([' city', ' degree','degree'], axis=1)

In [75]:
df7['age_group'] = df7['age_group'].astype(str)
df7['user_id'] = df7['user_id'].astype(str)
df7['graduation year'] = df7['graduation year'].astype(str)
df7['profession'] = df7['profession'].astype(str)
df7['qualification'] = df7['qualification'].astype(str)
df7['designation'] = df7['designation'].astype(str)
df7['department'] = df7['department'].astype(str)
df7['study_year'] = df7['study_year'].astype(str)
df7['exam_taker'] = df7['exam_taker'].astype(str)
df7['Course_id'] = df7['Course_id'].astype(str)

df8 = pd.merge(df7,z, on='Course_id', how='left')
df8.head()

df8.info()

In [81]:
cc=df7['Course_id'].unique()
len(cc)

2149

In [82]:
cc=df7['user_id'].unique()
len(cc)

3252562

In [86]:
table = pd.pivot_table(df7,index=['user_id'],values=['Course_id'], aggfunc=pd.Series.nunique)
table.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3252562 entries, User1 to User999999
Data columns (total 1 columns):
 #   Column     Dtype
---  ------     -----
 0   Course_id  int64
dtypes: int64(1)
memory usage: 49.6+ MB

In [87]:
table.head()

            Course_id
user_id
User1               1
User10              1
User100             5
User1000            1
User100000          2

In [88]:
table=table.drop(table[table['Course_id']<2].index,axis=0)
table.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1588843 entries, User100 to User999999
Data columns (total 1 columns):
 #   Column     Non-Null Count    Dtype
---  ------     --------------    -----
 0   Course_id  1588843 non-null  int64
dtypes: int64(1)
memory usage: 24.2+ MB

In [90]:
df_1 = pd.merge(table,df7, on='user_id', how='left')
df_1.head()

,user_id,Course_id_x,age_group,graduation year,profession,qualification,department,study_year,designation,exam_taker,Course_id_y
0,User100,5,20-30,2017,employed,bachelor4yr,,,,False,noc20_me02
1,User100,5,20-30,2017.0,employed,bachelor4yr,nan,nan,nan,nan,noc20_me53_23
2,User100,5,20-30,2017.0,employed,bachelor4yr,nan,nan,nan,nan,noc20_ae14_23
3,User100,5,20-30,2017.0,employed,bachelor4yr,nan,nan,nan,nan,noc20_ae06_23
4,User100,5,20-30,2017.0,employed,bachelor4yr,nan,nan,nan,nan,noc20_me56_23

In [92]:
df_1.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 7795148 entries, 0 to 7795147
Data columns (total 11 columns):
 #   Column           Dtype
---  ------           -----
 0   user_id          object
 1   Course_id_x      int64
 2   age_group        object
 3   graduation year  object
 4   profession       object
 5   qualification    object
 6   department       object
 7   study_year       object
 8   designation      object
 9   exam_taker       object
 10  Course_id_y      object
dtypes: int64(1), object(10)
memory usage: 713.7+ MB

In [98]:
column= df_1[["user_id","Course_id_y","exam_taker"]]
column.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 7795148 entries, 0 to 7795147
Data columns (total 3 columns):
 #   Column       Dtype
---  ------       -----
 0   user_id      object
 1   Course_id_y  object
 2   exam_taker   object
dtypes: object(3)
memory usage: 237.9+ MB

In [99]:
column1=column.drop_duplicates()

In [103]:
ass = column1.pivot(index=['user_id'], columns='Course_id_y', values='exam_taker', dropna=True)
ass.head()

TypeError: pivot() got an unexpected keyword argument 'dropna'